export const AuthMessage = {
  /**  =============================================================================
   *
   *        000 ~ 099	에러 코드
   *
   *   =============================================================================
   */
  /** */

  LOGIN_ERROR: '로그인 처리 중 서버에서 오류가 발생했습니다.',
  SIGNUP_ERROR: '회원가입 처리 중 서버에서 오류가 발생했습니다.',
  LOGOUT_ERROR: '로그아웃 처리 중 서버에서 오류가 발생했습니다.',
  REFRESH_ERROR: '토큰 재발급 처리 중 서버에서 오류가 발생했습니다.',

  /**  =============================================================================
   *
   *        200 ~ 299	성공 응답 코드
   *
   *   =============================================================================
   */
  /** */

  LOGIN_SUCCESS: '로그인 성공',
  SIGNUP_SUCCESS: '회원가입 성공',
  LOGOUT_SUCCESS: '로그아웃 성공',
  REFRESH_SUCCESS: '토큰 재발급 성공',
} as const;

export type AuthMessageType = (typeof AuthMessage)[keyof typeof AuthMessage];
