export const CoreMessage = {
  /**  =============================================================================
   *
   *        000 ~ 099	에러 코드
   *
   *   =============================================================================
   */
  /** */

  SERVER_ERROR: '서버 오류가 발생했습니다.',
  BAD_REQUEST: '잘못된 요청입니다.',
  UNAUTHORIZED: '인증이 필요합니다.',
  FORBIDDEN: '접근이 거부되었습니다.',

  /**  =============================================================================
   *
   *        200 ~ 299	성공 응답 코드
   *
   *   =============================================================================
   */
  /** */

  REQUEST_SUCCESS: '요청이 성공적으로 처리되었습니다.',
} as const;

export type CoreMessageType = (typeof CoreMessage)[keyof typeof CoreMessage];
